# UnableToTransformElementError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..UnableToTransformElementError Property
BuiltInFailures..::..EditingFailures Class See Also
---
Attempted an invalid element rotate, mirror, or move.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToTransformElementError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToTransformElementError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToTransformElementError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace